 # Introduction to Data Analysis with Python

<img src="https://www.python.org/static/img/python-logo.png" alt="yogen" style="width: 200px; float: right;"/>

# Objectives



*   Handle tabular data with `pandas`

# The Python scientific stack : SciPy

Python Main Data Libraries
NumPy: Base N-dimensional array package

SciPy library: Fundamental library for scientific computing

Matplotlib: Comprehensive 2D Plotting

IPython: Enhanced Interactive Console

Sympy: Symbolic mathematics

pandas: Data structures & analysis

## Saving our work to Google Drive

Colab is a very convenient environment, but an ephemeral one. Let's first configure our notebook to save our work to Google Drive, where it can be persisted.

In [1]:
 import os

In [ ]:
drive_loc = '/content/gdrive'
files_loc = os.path.join(drive_loc, "MyDrive", "pdsfyles_test")
from google.colab import drive
drive.mount(drive_loc)

Let's create a directory to hold all our work and make sure it's there:

In [ ]:
!mkdir -p {files_loc}

In [ ]:
!ls {files_loc}

example.db  excel_output.xls  s3.pkl  T100_AIRLINES.csv

In [ ]:
files_loc

'/content/gdrive/MyDrive/pdsfyles'

# Getting started

First, always remember to check the [API Reference](https://pandas.pydata.org/pandas-docs/stable/reference/index.html).

Convention: when you see `pd`, it means the imported `Pandas` module. We'll be combining it with Numpy as well:

## `pandas`

Distinct set of requirements that pandas introduces:

- Data structures with labeled axes supporting automatic or explicit data alignment. This prevents common errors resulting from misaligned data and working with differently-indexed data coming from different sources.

- Integrated time series functionality.

- The same data structures handle both time series data and non-time series data.

- Arithmetic operations and reductions (like summing across an axis) would pass on the metadata (axis labels).

- Flexible handling of missing data.

- Merge and other relational operations found in popular database databases (SQL-based, for example).

In [1]:
import pandas as pd
import numpy as np

Pandas is evolving. If you look around in the Internet or articles/books, you may find things that go back to Pandas 0.21. In our case, in the included Colab supported runtime, we've got:

In [3]:
pd.__version__ # en colab actualizado

'0.23.4'

Pandas Data Structures are **Series** and **Dataframes**. While they are not a universal solution, they provide a solid, easy-to-use foundation to data mangling tooling in the Data Science world.

### Series

A Series is a one-dimensional array-like object containing
- an array of **data** (of any NumPy data type)
- an associated array of data labels, called its **index**.

It is the base pandas abstraction. You can thing of it as the love child of a numpy array and a dictionary, sort of-ish.

The simplest Series is formed from only an array of data:

In [4]:
s = pd.Series ([4,7,-5,3])
type(s)

pandas.core.series.Series

In [5]:
s

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
for i, n in enumerate(s):
    
    if i==0:
        print(s[0])
    else:
        print(s[i+1] - s[i])

4
-12
8

KeyError: 4

In [42]:
for i, n in enumerate(s):
    if s[i] == 0 :
        print(n)
    else:
        print(s[i+1] - s[i])

3
-12
8

KeyError: 4

The string representation of a Series displayed interactively shows the index on the left and the values on the right. Since we did not specify an index for the data, a default one consisting of the integers 0 through N - 1 (where N is the length of the data) is created.

If we provide an index, pandas will use it. If not, it will automatically create one

In [7]:
s.index

RangeIndex(start=0, stop=4, step=1)

Yep, that was Pandas [optimizing things](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.RangeIndex.html#:~:text=RangeIndex%20is%20a%20memory%2Dsaving,is%20provided%20by%20the%20user.). Same thing, we can ask our Series for just the values:

In [8]:
s.values

array([ 4,  7, -5,  3])

Just to be sure, I told you this was a Numpy array. It is:

In [9]:
type(s.values) # array numpy los datos

numpy.ndarray

Often it will be desirable to create a Series with an index identifying each data point:

In [11]:
s2 = pd.Series ([1,2,4.5,7,2,23,15], index=list('javierc')) 
s2

j     1.0
a     2.0
v     4.5
i     7.0
e     2.0
r    23.0
c    15.0
dtype: float64

In [12]:
jkl = pd.Series ([1,2,3], index = list('ana', 'Paco', 'pedro'))

TypeError: list expected at most 1 arguments, got 3

In [13]:
s2 # tipo float x el decimal

j     1.0
a     2.0
v     4.5
i     7.0
e     2.0
r    23.0
c    15.0
dtype: float64

We were quite lazy back there providing the list, weren't we? 

Compared with a regular NumPy array, you can use values in the index when selecting single values or a set of values:

In [14]:
s2['r'] # ahora el slicing es con letras

23.0

In [15]:
s2[1]

2.0

Now, that's convenient.

NumPy array operations, such as filtering with a boolean array, scalar multiplication, or applying math functions, that you now know better than me, will preserve the index-value link

In [16]:
s2 % 2 == 0

j    False
a     True
v    False
i    False
e     True
r    False
c    False
dtype: bool

In [17]:
[s2 % 2 == 0].sum()

AttributeError: 'list' object has no attribute 'sum'

We can similarly apply boolean selection operations to the Series

In [18]:
s2[s2 % 2 == 0] # de la s2 dame solo los divisibles por 2. Se llama filtro

a    2.0
e    2.0
dtype: float64

In [24]:
s2[s2 % 2 == 0].sum()

4.0

In [25]:
s2[s2 % 2 == 0].count()

2

...and go beyond pure logical operations, of course:

In [26]:
s2 *2

j     2.0
a     4.0
v     9.0
i    14.0
e     4.0
r    46.0
c    30.0
dtype: float64

In [27]:
np.exp(s2) # tb operaciones con np

j    2.718282e+00
a    7.389056e+00
v    9.001713e+01
i    1.096633e+03
e    7.389056e+00
r    9.744803e+09
c    3.269017e+06
dtype: float64

Note that these operations are not being applied on the original object, but rather in a copy that's being returned:

In [28]:
s2 # continua igual, sino haberle asignado valiable

j     1.0
a     2.0
v     4.5
i     7.0
e     2.0
r    23.0
c    15.0
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values (because, remember, a Python dictionary is unordered, and it can be extended). It can be substituted into many functions that expect a dict:

In [29]:
'i' in s2

True

In [30]:
s2['i'].isin(s2)

AttributeError: 'numpy.float64' object has no attribute 'isin'

In [31]:
23.0 in s2

False

We can create Series from dictionaries:

In [32]:
sdata = {
    'Zaragoza' : 2.5e5,
    'Sevilla': 5e5,
    'Cordoba': 3e5,
    'Madrid': 6e6
}

s3 = pd.Series(sdata)
s3

Zaragoza     250000.0
Sevilla      500000.0
Cordoba      300000.0
Madrid      6000000.0
dtype: float64

We'll be using s3 later on, so because of the ephemeral nature of Colab, we'll store our Series in our Google Drive instead of redoing all the steps.

We'll be using as well a handy feature of Colab, which is Colab Forms to enable o disable the conditional execution of a code cell based on the UI input exposed by the form

In [33]:
#@title Saving s3 to Drive
#import os
#save_to_drive = True #@param {type:"boolean"}

#if save_to_drive and files_loc:
  #s3.to_pickle(os.path.join(files_loc,"s3.pkl"))
#else:
  #print('Please, mount Google Drive running the cell at the beginning and try again')

In [ ]:
s3.to_pickle(os.path.join(files_loc, "s3.pkl"))

In [ ]:
!ls {files_loc}/s3.pkl

/content/gdrive/MyDrive/pdsfyles/s3.pkl

In [ ]:
!ls {files_loc}

example.db  excel_output.xls  s3.pkl  T100_AIRLINES.csv

Ordenado de los datos

When only passing a dict, the index in the resulting Series will not have the dict’s keys in sorted order

In [34]:
s3

Zaragoza     250000.0
Sevilla      500000.0
Cordoba      300000.0
Madrid      6000000.0
dtype: float64

In [35]:
s3.sort_index()

Cordoba      300000.0
Madrid      6000000.0
Sevilla      500000.0
Zaragoza     250000.0
dtype: float64

In [36]:
s3

Zaragoza     250000.0
Sevilla      500000.0
Cordoba      300000.0
Madrid      6000000.0
dtype: float64

If you want the keys in sorted order, you need to explicitly define it with `sort_index()`:

In [37]:
s3 = pd.Series(sdata).sort_index() # alfabetica
s3

Cordoba      300000.0
Madrid      6000000.0
Sevilla      500000.0
Zaragoza     250000.0
dtype: float64

You can control the ordering as well by explicitly defining the index order using a list:

In [38]:
cities = ['Cordoba', 'Madrid', 'Valencia', 'Zaragoza']

In [39]:
s4 = pd.Series(sdata, index= cities) # alfabetica #Nan not a number, xq no estaba definido
s4

Cordoba      300000.0
Madrid      6000000.0
Valencia          NaN
Zaragoza     250000.0
dtype: float64

In this case, 3 values found in sdata were placed in the appropriate locations, but since no value for 'Valencia' was found, it appears as NaN (not a number) which is considered in pandas to mark missing or NA values. We will use the terms “missing” or “NA” to refer to missing data. The isnull and notnull functions in pandas should be used to detect missing data:

In [40]:
pd.isnull(s4)

Cordoba     False
Madrid      False
Valencia     True
Zaragoza    False
dtype: bool

In [41]:
pd.isnull(s4).sum()

1

In [42]:
pd.isnull(s4).count()

4

In [43]:
s4.isnull()

Cordoba     False
Madrid      False
Valencia     True
Zaragoza    False
dtype: bool

In [44]:
pd.notnull(s4)

Cordoba      True
Madrid       True
Valencia    False
Zaragoza     True
dtype: bool

In [45]:
s4.notnull().sum()

3

In [46]:
s4.notnull().count()

4

These can also be consumed as instance methods:

In [47]:
s4.notnull()

Cordoba      True
Madrid       True
Valencia    False
Zaragoza     True
dtype: bool

A critical Series feature for many applications is that it automatically aligns differently-indexed data in arithmetic operations:

In [48]:
s3

Cordoba      300000.0
Madrid      6000000.0
Sevilla      500000.0
Zaragoza     250000.0
dtype: float64

In [49]:
s4

Cordoba      300000.0
Madrid      6000000.0
Valencia          NaN
Zaragoza     250000.0
dtype: float64

In [50]:
s3 + s4 # sevilla nan, no es cero, x eso resultado nan

Cordoba       600000.0
Madrid      12000000.0
Sevilla            NaN
Valencia           NaN
Zaragoza      500000.0
dtype: float64

Both the Series object itself and its index have a name attribute, which integrates with other key areas of pandas functionality:

In [51]:
s4.name = 'Population' # como si fuera columna. serie population en s4

In [52]:
s4

Cordoba      300000.0
Madrid      6000000.0
Valencia          NaN
Zaragoza     250000.0
Name: Population, dtype: float64

In [53]:
type('Population')

str

In [54]:
s4.name

'Population'

In [55]:
s4.index.name = 'Province' # ahora indice tiene un nombre
s4

Province
Cordoba      300000.0
Madrid      6000000.0
Valencia          NaN
Zaragoza     250000.0
Name: Population, dtype: float64

In [56]:
type('Province')

str

In [57]:
s4.index

Index(['Cordoba', 'Madrid', 'Valencia', 'Zaragoza'], dtype='object', name='Province')

From what we've seen so far, it may look like the Series object is basically interchangeable with a one-dimensional NumPy array.

The essential difference is the presence of the index: while the Numpy Array has an implicitly defined integer index used to access the values, the Pandas Series has an explicitly defined index associated with the values.

## Dataframes

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dict of Series (one for all sharing the same index).

Row-oriented and column-oriented operations in DataFrame are treated roughly symmetrically. Under the hood, the data is stored as one or more two-dimensional blocks rather than a list, dict, or some other collection of one-dimensional arrays.

This is the object you'll work most of the time with. It represents a table of m observations x n variables. Each variable, or column, is a Series.

There are numerous ways to construct a DataFrame, though one of the most common is from a dict of equal-length lists or NumPy arrays.

Let's discuss the naming of axes in Pandas, both for series and dataframes.

For Series, because is a one-dimensional array of values, we've got only **Axis 0**:

![Series axes](https://drive.google.com/uc?export=view&id=1unXqkxjezJiaocs1D-OM2vdj9ad8OLbs)

The dataframe, as we've just seen, is a two-dimensional structure. It has columns and row, colums made of separate Series objects. The axes in the dataframe are as follows, where if not explicitly mentioned, axis 0 will always make the default:

![Dataframe axes](https://drive.google.com/uc?export=view&id=1f8jKqZTURUoM5wV1yz_Ax9PrXSr-uITy)

In [58]:
dfdata = {
    'province': ['M', 'M', 'M', 'B', 'B'],
    'population': [1.5e6, 2e6, 3e6, 5e5, 1.5e6],
    'year': [1900, 1950, 2000, 1900, 2000]
}

The resulting DataFrame will have its index assigned automatically as with Series, and the columns (axis 1) are placed in sorted order

In [59]:
df = pd.DataFrame(dfdata)
df

  province  population  year
0        M   1500000.0  1900
1        M   2000000.0  1950
2        M   3000000.0  2000
3        B    500000.0  1900
4        B   1500000.0  2000

In [60]:
df['resultado'] = df['population'].shift(-1) - df['population']
df

  province  population  year  resultado
0        M   1500000.0  1900   500000.0
1        M   2000000.0  1950  1000000.0
2        M   3000000.0  2000 -2500000.0
3        B    500000.0  1900  1000000.0
4        B   1500000.0  2000        NaN

If you specify a sequence of columns, the DataFrame’s columns will be exactly what you pass, and as with Series, if you pass a column that isn’t contained in data, it will appear with NA values in the result:

In [61]:
df.columns

Index(['province', 'population', 'year', 'resultado'], dtype='object')

In [62]:
df2 = pd.DataFrame(dfdata, columns=['province', 'population', 'year', 'debt'])

In [63]:
df2

  province  population  year debt
0        M   1500000.0  1900  NaN
1        M   2000000.0  1950  NaN
2        M   3000000.0  2000  NaN
3        B    500000.0  1900  NaN
4        B   1500000.0  2000  NaN

If we check the nature of the index in the dataframe, we can see we have the same as in Series:

In [64]:
df2.index # esto es rangeindex, crea padas y es un iterador

RangeIndex(start=0, stop=5, step=1)

There's a new property we can access called columns, where we can see we've got just another index:

In [65]:
df2.columns # esto es un index

Index(['province', 'population', 'year', 'debt'], dtype='object')

In [66]:
df2.columns.tolist()

['province', 'population', 'year', 'debt']

In [67]:
df2.isnull()

   province  population   year  debt
0     False       False  False  True
1     False       False  False  True
2     False       False  False  True
3     False       False  False  True
4     False       False  False  True

In [68]:
df2.isnull().sum()

province      0
population    0
year          0
debt          5
dtype: int64

In [69]:
df2.isnull().count()

province      5
population    5
year          5
debt          5
dtype: int64

In [70]:
type(df2.columns)

pandas.core.indexes.base.Index

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:

In [71]:
df2['population'] # me devuelve una serie, la de columna

0    1500000.0
1    2000000.0
2    3000000.0
3     500000.0
4    1500000.0
Name: population, dtype: float64

In [72]:
df2.population

0    1500000.0
1    2000000.0
2    3000000.0
3     500000.0
4    1500000.0
Name: population, dtype: float64


Note that the returned Series have the same index as the DataFrame, and their name attribute has been appropriately set.

You can see that what's being returned is in fact a Series object, altough as of now it should be quite clear:

In [73]:
type(df2.population)

pandas.core.series.Series

Using this notation, we can add more columns and they will be indexed following the criteria already defined by the dataframe:

In [74]:
df2['2nd_language'] = np.nan #añadir columna

In [75]:
df2

  province  population  year debt  2nd_language
0        M   1500000.0  1900  NaN           NaN
1        M   2000000.0  1950  NaN           NaN
2        M   3000000.0  2000  NaN           NaN
3        B    500000.0  1900  NaN           NaN
4        B   1500000.0  2000  NaN           NaN

When assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, it will be instead conformed exactly to the DataFrame’s index, inserting missing values in any holes:

In [76]:
df2['2nd_language']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: 2nd_language, dtype: float64

But watch out with the naming used, you may hit some of the Python syntax constraints:

In [77]:
df2.2nd_language #cuidado puntos y nombrar columnas. despues punto nunca numero

SyntaxError: invalid syntax (<ipython-input-77-104927366da7>, line 1)

In [78]:
df2.isnull().sum()

province        0
population      0
year            0
debt            5
2nd_language    5
dtype: int64

As with Series, we can name the index of the dataframe:

In [79]:
#poner nombre al index a letras
df2.index = list('abcde')

In [80]:
df2

  province  population  year debt  2nd_language
a        M   1500000.0  1900  NaN           NaN
b        M   2000000.0  1950  NaN           NaN
c        M   3000000.0  2000  NaN           NaN
d        B    500000.0  1900  NaN           NaN
e        B   1500000.0  2000  NaN           NaN

This is not a RangeIndex anymore, but a regular Index:

In [81]:
df2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

We can access a particular row of the Dataframe using the property loc

In [82]:
df2.loc['c'] # etiqueta de la fila que quiero obtener. Tiene como indice las etiqutas. Para localiza. me devuelve serie.

province            M
population      3e+06
year             2000
debt              NaN
2nd_language      NaN
Name: c, dtype: object

In [83]:
type(df2.loc['c'])

pandas.core.series.Series

loc admits a list or array of labels:

In [84]:
df2.loc[['a', 'c']]

  province  population  year debt  2nd_language
a        M   1500000.0  1900  NaN           NaN
c        M   3000000.0  2000  NaN           NaN

In [85]:
df2.loc['a':'c'] # ojo!aquio son inclusivas, diferencia de python, no exatamente slicing de python

  province  population  year debt  2nd_language
a        M   1500000.0  1900  NaN           NaN
b        M   2000000.0  1950  NaN           NaN
c        M   3000000.0  2000  NaN           NaN

We can also pass it an slice object of labels:

In [86]:
df2.loc['c':'a'] # esto no funciona

Empty DataFrame
Columns: [province, population, year, debt, 2nd_language]
Index: []

If we pass a list with the specific row instead of the label as is, we get the nice Dataframe formatting instead of the Series:

In [87]:
df2.loc[['c']] # con la lista me devuelve un dataframe

  province  population  year debt  2nd_language
c        M   3000000.0  2000  NaN           NaN

In [88]:
type(df2.loc[['c']])

pandas.core.frame.DataFrame

We can eve use a callable condition for matching rows:

In [89]:
df2.loc[df2['year'] > 1950] # como un filtrado, las q cumplemn > 1950

  province  population  year debt  2nd_language
c        M   3000000.0  2000  NaN           NaN
e        B   1500000.0  2000  NaN           NaN

When assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, it will be instead conformed exactly to the DataFrame’s index, inserting missing values in any holes:

In [90]:
val = pd.Series([0.1, 0.6, 0.9], index = ['b', 'd', 'e'])# meter valores en el df
val

b    0.1
d    0.6
e    0.9
dtype: float64

So let's define values for a particular label or column by passing them as a list:

In [91]:
df2['debt'] = [1,0,2,0.5,0.7] # asignacio n directa de la columna

In [92]:
df2

  province  population  year  debt  2nd_language
a        M   1500000.0  1900   1.0           NaN
b        M   2000000.0  1950   0.0           NaN
c        M   3000000.0  2000   2.0           NaN
d        B    500000.0  1900   0.5           NaN
e        B   1500000.0  2000   0.7           NaN

In [93]:
test = pd.Series([5, 5, 5,5,5])
test

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [94]:
df2['debt'] = test # asigno a la variable, asignacon de la serie completa, np se han respetado los valores de a no c
df2

  province  population  year  debt  2nd_language
a        M   1500000.0  1900   NaN           NaN
b        M   2000000.0  1950   NaN           NaN
c        M   3000000.0  2000   NaN           NaN
d        B    500000.0  1900   NaN           NaN
e        B   1500000.0  2000   NaN           NaN

In [95]:
df2['debt'] = val # asigno a la variable, asignacon de la serie completa, np se han respetado los valores de a no c
df2

  province  population  year  debt  2nd_language
a        M   1500000.0  1900   NaN           NaN
b        M   2000000.0  1950   0.1           NaN
c        M   3000000.0  2000   NaN           NaN
d        B    500000.0  1900   0.6           NaN
e        B   1500000.0  2000   0.9           NaN

Assigning a column that doesn’t exist will create a new column:

In [96]:
df2['capital'] = df2['province'] = 'M' #ojo aqui asignación de toda la columna, ya no hay B

In [97]:
df2

  province  population  year  debt  2nd_language capital
a        M   1500000.0  1900   NaN           NaN       M
b        M   2000000.0  1950   0.1           NaN       M
c        M   3000000.0  2000   NaN           NaN       M
d        M    500000.0  1900   0.6           NaN       M
e        M   1500000.0  2000   0.9           NaN       M

In [98]:
df2['capital'] = df2['province'] =='M' # CREA una columna nueva si no esta
df2

  province  population  year  debt  2nd_language  capital
a        M   1500000.0  1900   NaN           NaN     True
b        M   2000000.0  1950   0.1           NaN     True
c        M   3000000.0  2000   NaN           NaN     True
d        M    500000.0  1900   0.6           NaN     True
e        M   1500000.0  2000   0.9           NaN     True

The del keyword will delete columns as with a dict:

In [165]:
del df2['2nd_language']
df2

  province  population  year  debt  capital
a        M   1500000.0  1900   NaN     True
b        M   2000000.0  1950   0.1     True
c        M   3000000.0  2000   NaN     True
d        B    500000.0  1900   0.6    False
e        B   1500000.0  2000   0.9    False

In [166]:
df2['2nd_language'] = np.nan
df2

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
c        M   3000000.0  2000   NaN     True           NaN
d        B    500000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

You can always transpose the Dataframe and it will switch the indexes in the corresponding axes:

In [167]:
df2.T # cambiamos filas por columnas transposicion

                    a      b      c       d        e
province            M      M      M       B        B
population    1.5e+06  2e+06  3e+06  500000  1.5e+06
year             1900   1950   2000    1900     2000
debt              NaN    0.1    NaN     0.6      0.9
capital          True   True   True   False    False
2nd_language      NaN    NaN    NaN     NaN      NaN

The method describe computes a set of summary statistics for Servies of each DataFrame column:

In [168]:
df2.describe() # valores estadisticos

         population    year      debt  2nd_language
count  5.000000e+00     5.0  3.000000           0.0
mean   1.700000e+06  1950.0  0.533333           NaN
std    9.082951e+05    50.0  0.404145           NaN
min    5.000000e+05  1900.0  0.100000           NaN
25%    1.500000e+06  1900.0  0.350000           NaN
50%    1.500000e+06  1950.0  0.600000           NaN
75%    2.000000e+06  2000.0  0.750000           NaN
max    3.000000e+06  2000.0  0.900000           NaN

Of course, we can transpose this as well:

In [169]:
df2.describe().T

,count,mean,std,min,25%,50%,75%,max
population,5.0,1.700000e+06,908295.106229,500000.0,1500000.00,1500000.0,2000000.00,3000000.0
year,5.0,1.950000e+03,50.000000,1900.0,1900.00,1950.0,2000.00,2000.0
debt,3.0,5.333333e-01,0.404145,0.1,0.35,0.6,0.75,0.9
2nd_language,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

One simple way of counting/finding non nulls is to just apply the count() method on our dataframe:

In [171]:
df2

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
c        M   3000000.0  2000   NaN     True           NaN
d        B    500000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

In [170]:
df2.count() # cero cuanod no hay ningun valor

province        5
population      5
year            5
debt            3
capital         5
2nd_language    0
dtype: int64

### Index objects

Pandas’s Index objects are responsible for holding the axis labels and other metadata (like the axis name or names). Any array or other sequence of labels used when constructing a Series or DataFrame is internally converted to an Index, which are immutable and can't be modified by you:

In [ ]:
df2.index[1] = 'x' # no sepuede cambiar el indice por x es inmutable, xa proteger los datos

TypeError: ignored

In [172]:
df2.index[1]

'b'

Inmutability is important so that Index objects ca be safely shared amongst data structures:

In [175]:
series_temp = pd.Series([1.5, -2.5, 0, 1, 2], df2.index)
series_temp

a    1.5
b   -2.5
c    0.0
d    1.0
e    2.0
dtype: float64

We can also manipulate rows by referencing the index location in a similar manner to what we saw before:

In [176]:
df2.iloc[2:]

  province  population  year  debt  capital  2nd_language
c        M   3000000.0  2000   NaN     True           NaN
d        B    500000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

In [ ]:
#@title Saving df2 to Drive
import os
save_to_drive = True #@param {type:"boolean"}

if save_to_drive and files_loc:
  df2.to_pickle(os.path.join(files_loc,"df2.pkl"))
else:
  print('Please, mount Google Drive running the cell at the beginning and try again')

In [ ]:
!ls {files_loc}

df2.pkl  example.db  excel_output.xls  s3.pkl  T100_AIRLINES.csv

In [ ]:
files_loc

'/content/gdrive/MyDrive/pdsfyles'

### More on Loc and iLoc [optional practice]
See section 1 of the scrapbook.

### Dropping entries from an axis

Dropping one or more entries from an axis is easy if you have an index array or list without those entries. As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from an axis.

Let's create a new series to demonstrate all this:

In [ ]:
# eliminar entradas

In [99]:
s5 = pd.Series(np.arange(5), list('jvduk'))
s5

j    0
v    1
d    2
u    3
k    4
dtype: int64

In [100]:
s6 = s5.drop(['d','k']) # eliminar la serie d y k
s6

j    0
v    1
u    3
dtype: int64

Yes, we dropped elements present in the index defined by a list, but can we do just the opposite and keep the elements provided in a list while dropping everything else?:

In [101]:
s6b=s5[s5.index.intersection(['d','k'])]# que se quede solo d y k
s6b

d    2
k    4
dtype: int64

By default, `drop()` doesn't modify the original Series, it creates a copy. We can change that with the argument `inplace` that we'll see later on:

In [102]:
s5

j    0
v    1
d    2
u    3
k    4
dtype: int64

In [103]:
s6['u'] = 7
s6

j    0
v    1
u    7
dtype: int64

In [104]:
s6.drop(['u'])

j    0
v    1
dtype: int64

In [105]:
s6

j    0
v    1
u    7
dtype: int64

In [106]:
s6.drop(['u'], inplace = True)

In [107]:
s6

j    0
v    1
dtype: int64

Let's now work with Dataframes. First, let's see dropping elements from axes in a dataframe:

In [ ]:
df2 = pd.read_pickle(os.path.join)(files_loc, "df2.pkl") # si quisieramo recuperar lo guardado. pickle especifico de python

In [ ]:
#@title Loading df2 from Drive
load_from_drive = True #@param {type:"boolean"}

if load_from_drive and files_loc:
  df2 = pd.read_pickle(os.path.join(files_loc,"df2.pkl"))
else:
  print('Please, mount Google Drive running the cell at the beginning and try again')

In [190]:
df2

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
c        M   3000000.0  2000   NaN     True           NaN
d        B    500000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

Using `drop` on the dataframe will operate on the defaul axis 0, meaning that the specified object needs to be a **row**:

In [191]:
df2.drop('c') # x defecto indice 0

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
d        B    500000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

Let's now select the columns axis (axis 1) to remove a specific **column**, in this case `2nd_language`:

In [192]:
df2.drop('2nd_language', axis =1)

  province  population  year  debt  capital
a        M   1500000.0  1900   NaN     True
b        M   2000000.0  1950   0.1     True
c        M   3000000.0  2000   NaN     True
d        B    500000.0  1900   0.6    False
e        B   1500000.0  2000   0.9    False

We can see that we didn't modify the dataframe. In fact, we can make a copy to it:

In [193]:
df2

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
c        M   3000000.0  2000   NaN     True           NaN
d        B    500000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

In [194]:
df3 = df2.copy() #para copia
df3

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
c        M   3000000.0  2000   NaN     True           NaN
d        B    500000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

Yes! the `copy()` method is in fact a deep copy and what we're avoiding is accidentally modifying the original dataframe. Let's have a look with another example (slight detour).

In [195]:
df_detour = pd.DataFrame({'x' : [1,2]}) # asignacion

In [196]:
df_detour

   x
0  1
1  2

In [197]:
df_sub = df_detour[0:1]

In [198]:
df_sub

   x
0  1

In [199]:
df_sub.x = -1
df_detour

/home/dsc/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:4405: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

   x
0 -1
1  2

Aha! We even get a warning... but let's continue and see how this, in contrast, leaves df_detour unchanged:

In [200]:
df_detour = pd.DataFrame({'x': [1,2]})
df_sub_copy = df_detour[0:1].copy()
df_sub_copy.x = -1
df_detour

   x
0  1
1  2

OK, going back to what we were doing!

As mentioned before, let's use the parameter `inplace` to modify the dataframe right away:

In [ ]:
# drop in place

In [201]:
df3.drop('capital', axis =1, inplace=True) # xa no duplicar memoria el inplace. se utiliza cuando seguros de modificar el original

In [202]:
df3

  province  population  year  debt  2nd_language
a        M   1500000.0  1900   NaN           NaN
b        M   2000000.0  1950   0.1           NaN
c        M   3000000.0  2000   NaN           NaN
d        B    500000.0  1900   0.6           NaN
e        B   1500000.0  2000   0.9           NaN

### Indexing, selection, and filtering

The key here is that we can build boolean Series that we can use to index the original Series or DataFrame. Those booleans can be combined with bitwise boolean operators (&, |, ~) to get filters that are as complex as we need.

In [ ]:
#@title Loading s3 from Drive
load_from_drive = True #@param {type:"boolean"}

if load_from_drive and files_loc:
  s3 = pd.read_pickle(os.path.join(files_loc,"s3.pkl"))
else:
  print('Please, mount Google Drive running the cell at the beginning and try again')

In [212]:
s3 = s3.sort_index()
s3

Cordoba      300000.0
Madrid      6000000.0
Sevilla      500000.0
Zaragoza     250000.0
dtype: float64

We can select elements from the Series just passing a list of them:

In [213]:
s3[['Zaragoza', 'Madrid']]

Zaragoza     250000.0
Madrid      6000000.0
dtype: float64

Of course, we can use slice notation (remember we start at 0):

In [214]:
s3[2:]

Sevilla     500000.0
Zaragoza    250000.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive:

In [215]:
s3['Cordoba':'Sevilla']

Cordoba     300000.0
Madrid     6000000.0
Sevilla     500000.0
dtype: float64

But be careful, because by using the index position we default back to good ol' Python behavior (not inclusive):

In [216]:
s3[1:2] # no son inclusivos ptra vez, ojo

Madrid    6000000.0
dtype: float64

We can apply a filter to the whole Series, generating in fact a boolean mask:

In [217]:
s3 > 1e6

Cordoba     False
Madrid       True
Sevilla     False
Zaragoza    False
dtype: bool

...and we can pass that boolean mask to the Series itself:

In [218]:
s3[s3>1e06]

Madrid    6000000.0
dtype: float64

Let's work now with our dataframe `df3`:

In [219]:
df3

  province  population  year  debt  2nd_language
a        M   1500000.0  1900   NaN           NaN
b        M   2000000.0  1950   0.1           NaN
c        M   3000000.0  2000   NaN           NaN
d        B    500000.0  1900   0.6           NaN
e        B   1500000.0  2000   0.9           NaN

First, let's build a boolean mask (filter) over the column `year` of our dataframe, which will give us a Series:

In [220]:
df3['year'] > 1950 # booleano para valores:

a    False
b    False
c     True
d    False
e     True
Name: year, dtype: bool

And then, let's apply that filter over the full dataframe. The dataframe will match the Series name against its columns and will proceed to filter out the rows (axis 0) that match the criteria:

In [221]:
df3[df3['year'] > 1950 ] # xa valores

  province  population  year  debt  2nd_language
c        M   3000000.0  2000   NaN           NaN
e        B   1500000.0  2000   0.9           NaN

We can combine all this, making more powerful filters:

In [222]:
df3[(df3['year'] > 1950) & (df3['debt']> 0.5) ] # mejor hacer por pasos pra TFM

  province  population  year  debt  2nd_language
e        B   1500000.0  2000   0.9           NaN

We can as well write this in a more elegant and Pythonic way:

In [223]:
recent = df3['year'] > 1950
indebdet = df3['debt'] > 0.5

df3[recent & indebdet]

  province  population  year  debt  2nd_language
e        B   1500000.0  2000   0.9           NaN

### Function application and mapping

Function application and mapping allows us to modify the elements of a DataFrame (columns with apply or elements with applymap) without for loops. This way we are not constrained to the functions already implemented by pandas or numpy.

In [224]:
df3

  province  population  year  debt  2nd_language
a        M   1500000.0  1900   NaN           NaN
b        M   2000000.0  1950   0.1           NaN
c        M   3000000.0  2000   NaN           NaN
d        B    500000.0  1900   0.6           NaN
e        B   1500000.0  2000   0.9           NaN

In [225]:
np.sqrt(df3['population'])

a    1224.744871
b    1414.213562
c    1732.050808
d     707.106781
e    1224.744871
Name: population, dtype: float64

In [226]:
df4 = pd.DataFrame(np.random.randn(4,3)*17 +15, columns=list('bde'), index=list('BMPZ'))
df4

           b          d          e
B  12.592828  36.297590   8.068848
M  37.646279  23.995790  14.403671
P  15.913794  26.397956  20.201187
Z  -8.409624  14.572550  20.955142

In [227]:
np.abs(df4)

           b          d          e
B  12.592828  36.297590   8.068848
M  37.646279  23.995790  14.403671
P  15.913794  26.397956  20.201187
Z   8.409624  14.572550  20.955142

This is a typical use case for lambdas (anonymous functions)

In [228]:
df4.apply(lambda series: series.max() - series.min()) # en columnas

b    46.055902
d    21.725040
e    12.886293
dtype: float64

In [229]:
df4.applymap(lambda element : element % 10)

          b         d         e
B  2.592828  6.297590  8.068848
M  7.646279  3.995790  4.403671
P  5.913794  6.397956  0.201187
Z  1.590376  4.572550  0.955142

In [230]:
df4.apply(lambda series: series.max() - series.min(), axis=1) # por fila

B    28.228742
M    23.242608
P    10.484162
Z    29.364765
dtype: float64

In [231]:
def f(series) :
    
      return pd.Series([series.max(), series.min()], index=['max', 'min']) 

df4.apply(f)

             b         d          e
max  37.646279  36.29759  20.955142
min  -8.409624  14.57255   8.068848

In [232]:
df4

           b          d          e
B  12.592828  36.297590   8.068848
M  37.646279  23.995790  14.403671
P  15.913794  26.397956  20.201187
Z  -8.409624  14.572550  20.955142

In [233]:
for item in df4.items():
  print(item)

('b', B    12.592828
M    37.646279
P    15.913794
Z    -8.409624
Name: b, dtype: float64)
('d', B    36.297590
M    23.995790
P    26.397956
Z    14.572550
Name: d, dtype: float64)
('e', B     8.068848
M    14.403671
P    20.201187
Z    20.955142
Name: e, dtype: float64)

In [234]:
for item in df4.iteritems():
  print(item) # hace lo mismo.
  # sepuede iterar sobre eje 1

('b', B    12.592828
M    37.646279
P    15.913794
Z    -8.409624
Name: b, dtype: float64)
('d', B    36.297590
M    23.995790
P    26.397956
Z    14.572550
Name: d, dtype: float64)
('e', B     8.068848
M    14.403671
P    20.201187
Z    20.955142
Name: e, dtype: float64)

In [235]:
map(f, [1,2])

In [236]:
def format_2digits(number):
    return '%.2f' % number

In [237]:
df4.applymap(format_2digits)

       b      d      e
B  12.59  36.30   8.07
M  37.65  24.00  14.40
P  15.91  26.40  20.20
Z  -8.41  14.57  20.96

### Sorting and ranking

In [238]:
df4

           b          d          e
B  12.592828  36.297590   8.068848
M  37.646279  23.995790  14.403671
P  15.913794  26.397956  20.201187
Z  -8.409624  14.572550  20.955142

In [239]:
df4.sort_index(ascending=True) #menor a mayor

           b          d          e
B  12.592828  36.297590   8.068848
M  37.646279  23.995790  14.403671
P  15.913794  26.397956  20.201187
Z  -8.409624  14.572550  20.955142

In [240]:
df4.sort_index(ascending=False) #mayor a menor

           b          d          e
Z  -8.409624  14.572550  20.955142
P  15.913794  26.397956  20.201187
M  37.646279  23.995790  14.403671
B  12.592828  36.297590   8.068848

In [241]:
df4.sort_index(ascending=True, axis =1) #bde

           b          d          e
B  12.592828  36.297590   8.068848
M  37.646279  23.995790  14.403671
P  15.913794  26.397956  20.201187
Z  -8.409624  14.572550  20.955142

In [242]:
df4.sort_index(ascending=False, axis=1) #edb

           e          d          b
B   8.068848  36.297590  12.592828
M  14.403671  23.995790  37.646279
P  20.201187  26.397956  15.913794
Z  20.955142  14.572550  -8.409624

In [243]:
df4.sort_values(by='e') # ordenar x una columna

           b          d          e
B  12.592828  36.297590   8.068848
M  37.646279  23.995790  14.403671
P  15.913794  26.397956  20.201187
Z  -8.409624  14.572550  20.955142

We can sort by two columns

In [244]:
df4.sort_values(by=['e','b']) # para 2 columnas

           b          d          e
B  12.592828  36.297590   8.068848
M  37.646279  23.995790  14.403671
P  15.913794  26.397956  20.201187
Z  -8.409624  14.572550  20.955142

In [245]:
s1 = pd.Series([2,3,8,4,3,2,1], index=list('abcdefg'))
s1

a    2
b    3
c    8
d    4
e    3
f    2
g    1
dtype: int64

In [248]:
s1.sort_values()

g    1
a    2
f    2
b    3
e    3
d    4
c    8
dtype: int64

In [247]:
s1.sort_values(ascending = False)

c    8
d    4
e    3
b    3
f    2
a    2
g    1
dtype: int64

rank() returns the positions of the elements of the Series in its sorted version. If there are ties, it will take averages.

In [249]:
s1.rank()

a    2.5
b    4.5
c    7.0
d    6.0
e    4.5
f    2.5
g    1.0
dtype: float64

In [252]:
s1.rank().sort_values()

g    1.0
a    2.5
f    2.5
b    4.5
e    4.5
d    6.0
c    7.0
dtype: float64

In [251]:
s1.rank().sort_values(ascending = False)

c    7.0
d    6.0
e    4.5
b    4.5
f    2.5
a    2.5
g    1.0
dtype: float64

In [253]:
pd.Series([1,1,1]).rank()

0    2.0
1    2.0
2    2.0
dtype: float64

In [254]:
s2 = pd.Series([30,10,20], index=list('abc'))
s2

a    30
b    10
c    20
dtype: int64

In [255]:
s2.rank()

a    3.0
b    1.0
c    2.0
dtype: float64

In [ ]:
help(s2.rank)

Help on method rank in module pandas.core.generic:

rank(axis=0, method:str='average', numeric_only:Union[bool, NoneType]=None, na_option:str='keep', ascending:bool=True, pct:bool=False) -> ~FrameOrSeries method of pandas.core.series.Series instance
    Compute numerical data ranks (1 through n) along axis.

    By default, equal values are assigned a rank that is the average of the
    ranks of those values.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Index to direct ranking.
    method : {'average', 'min', 'max', 'first', 'dense'}, default 'average'
        How to rank the group of records that have the same value (i.e. ties):

        * average: average rank of the group
        * min: lowest rank in the group
        * max: highest rank in the group
        * first: ranks assigned in order they appear in the array
        * dense: like 'min', but rank always increases by 1 between groups.

    numeric_only : bool, optional
        For DataFrame objects, rank only numeric columns if set to True.
    na_option : {'keep', 'top', 'bottom'}, default 'keep'
        How to rank NaN values:

        * keep: assign NaN rank to NaN values
        * top: assign smallest rank to NaN values if ascending
        * bottom: assign highest rank to NaN values if ascending.

    ascending : bool, default True
        Whether or not the elements should be ranked in ascending order.
    pct : bool, default False
        Whether or not to display the returned rankings in percentile
        form.

    Returns
    -------
    same type as caller
        Return a Series or DataFrame with data ranks as values.

    See Also
    --------
    core.groupby.GroupBy.rank : Rank of values within each group.

    Examples
    --------
    >>> df = pd.DataFrame(data={'Animal': ['cat', 'penguin', 'dog',
    ...                                    'spider', 'snake'],
    ...                         'Number_legs': [4, 2, 4, 8, np.nan]})
    >>> df
        Animal  Number_legs
    0      cat          4.0
    1  penguin          2.0
    2      dog          4.0
    3   spider          8.0
    4    snake          NaN

    The following example shows how the method behaves with the above
    parameters:

    * default_rank: this is the default behaviour obtained without using
      any parameter.
    * max_rank: setting ``method = 'max'`` the records that have the
      same values are ranked using the highest rank (e.g.: since 'cat'
      and 'dog' are both in the 2nd and 3rd position, rank 3 is assigned.)
    * NA_bottom: choosing ``na_option = 'bottom'``, if there are records
      with NaN values they are placed at the bottom of the ranking.
    * pct_rank: when setting ``pct = True``, the ranking is expressed as
      percentile rank.

    >>> df['default_rank'] = df['Number_legs'].rank()
    >>> df['max_rank'] = df['Number_legs'].rank(method='max')
    >>> df['NA_bottom'] = df['Number_legs'].rank(na_option='bottom')
    >>> df['pct_rank'] = df['Number_legs'].rank(pct=True)
    >>> df
        Animal  Number_legs  default_rank  max_rank  NA_bottom  pct_rank
    0      cat          4.0           2.5       3.0        2.5     0.625
    1  penguin          2.0           1.0       1.0        1.0     0.250
    2      dog          4.0           2.5       3.0        2.5     0.625
    3   spider          8.0           4.0       4.0        4.0     1.000
    4    snake          NaN           NaN       NaN        5.0       NaN

#### Exercise

Write a function that takes a Series and returns the top 10% registers. In this case, earners. Test it with this Series:

```python
salaries = pd.Series([150000, 90000, 120000,30000,10000,5000,40000, 50000, 80000, 35000, 27000,14000, 28000, 22000,25000])
```

In [258]:
salaries = pd.Series([150000, 90000, 120000,30000,10000,5000,40000, 50000, 80000, 35000, 27000,14000, 28000, 22000,25000])

In [259]:
for i in salaries:
    print(i)

150000
90000
120000
30000
10000
5000
40000
50000
80000
35000
27000
14000
28000
22000
25000

In [261]:
salaries.sort_values(ascending = False)

0     150000
2     120000
1      90000
8      80000
7      50000
6      40000
9      35000
3      30000
12     28000
10     27000
14     25000
13     22000
11     14000
4      10000
5       5000
dtype: int64

In [278]:

def earnes(salaries):
    registers = []
    for i in salaries:
        reg_i = i%10
        registers.append(reg_i)
        

    print(reg_i)

In [279]:
earnes(salaries)

0

In [280]:
len(salaries)

15

In [281]:
help(round)

Help on built-in function round in module builtins:

round(number, ndigits=None)
    Round a number to a given precision in decimal digits.

    The return value is an integer if ndigits is omitted or None.  Otherwise
    the return value has the same type as the number.  ndigits may be negative.

In [ ]:
def top_earners(salaries):
  number_to_extract = round(len(salaries) / 10)
  return salaries.sort_values()[-number_to_extract: ]

top_earners(salaries)

2    120000
0    150000
dtype: int64

In [ ]:
def top_earners(salaries, percentile=0.9):
  is_top_earners = salaries.rank(pct = True) > percentile
  return salaries[is_top_earners]

print(top_earners(salaries))

0    150000
2    120000
dtype: int64

In [ ]:
def top_earners(salaries, percentile=0.1):
  is_top_earners = salaries.rank(pct = True) > percentile
  return salaries[is_top_earners]

print(top_earners(salaries))

0     150000
1      90000
2     120000
3      30000
4      10000
6      40000
7      50000
8      80000
9      35000
10     27000
11     14000
12     28000
13     22000
14     25000
dtype: int64

In [ ]:
def top_earners(salaries, percentile=0.8):
  is_top_earners = salaries.rank(pct = True) > percentile
  return salaries[is_top_earners]

print(top_earners(salaries))

0    150000
1     90000
2    120000
dtype: int64

## Summarizing and computing descriptive statistics

In [109]:
x = pd.Series([1.2, np.nan, 4, np.nan, 9], index = list('abcde'))
y = pd.Series([5,3,7, np.nan, 14], index = list('abcde'))

In [111]:
x

a    1.2
b    NaN
c    4.0
d    NaN
e    9.0
dtype: float64

In [112]:
df =pd.DataFrame([x,y])
df

     a    b    c   d     e
0  1.2  NaN  4.0 NaN   9.0
1  5.0  3.0  7.0 NaN  14.0

In [113]:
df =pd.DataFrame([x,y], index=['x', 'y'])
df

     a    b    c   d     e
x  1.2  NaN  4.0 NaN   9.0
y  5.0  3.0  7.0 NaN  14.0

In [295]:
df =pd.DataFrame([x,y], index=['x', 'y']).T
df

     x     y
a  1.2   5.0
b  NaN   3.0
c  4.0   7.0
d  NaN   NaN
e  9.0  14.0

In [114]:
df = pd.DataFrame([x, y], index=['x','y'])
df

     a    b    c   d     e
x  1.2  NaN  4.0 NaN   9.0
y  5.0  3.0  7.0 NaN  14.0

In [115]:
df.sum()

a     6.2
b     3.0
c    11.0
d     0.0
e    23.0
dtype: float64

In [116]:
df.count()

a    2
b    1
c    2
d    0
e    2
dtype: int64

In [117]:
df.count(axis=1)

x    3
y    4
dtype: int64

In [118]:
df.sum(axis=1)

x    14.2
y    29.0
dtype: float64

In [119]:
df.isnull().sum()

a    0
b    1
c    0
d    2
e    0
dtype: int64

In [120]:
df.isnull().count()

a    2
b    2
c    2
d    2
e    2
dtype: int64

As with many methods, we can use them in the direction perpendicular to their default.

In [121]:
df.sum(axis=1)

x    14.2
y    29.0
dtype: float64

In [122]:
df.sum(axis=1, skipna=False)

x   NaN
y   NaN
dtype: float64

In [123]:
df.sum(skipna=False)

a     6.2
b     NaN
c    11.0
d     NaN
e    23.0
dtype: float64

In [124]:
df.sum(skipna=True)

a     6.2
b     3.0
c    11.0
d     0.0
e    23.0
dtype: float64

In [125]:
df.mean()

a     3.1
b     3.0
c     5.5
d     NaN
e    11.5
dtype: float64

In [126]:
df.mean(axis=1)

x    4.733333
y    7.250000
dtype: float64

In [127]:
df.cumsum()

     a    b     c   d     e
x  1.2  NaN   4.0 NaN   9.0
y  6.2  3.0  11.0 NaN  23.0

In [128]:
df

     a    b    c   d     e
x  1.2  NaN  4.0 NaN   9.0
y  5.0  3.0  7.0 NaN  14.0

In [316]:
df.std()

a    2.687006
b         NaN
c    2.121320
d         NaN
e    3.535534
dtype: float64

In [306]:
df

     a    b    c   d     e
x  1.2  NaN  4.0 NaN   9.0
y  5.0  3.0  7.0 NaN  14.0

In [318]:
df.describe()

              a    b        c    d          e
count  2.000000  1.0  2.00000  0.0   2.000000
mean   3.100000  3.0  5.50000  NaN  11.500000
std    2.687006  NaN  2.12132  NaN   3.535534
min    1.200000  3.0  4.00000  NaN   9.000000
25%    2.150000  3.0  4.75000  NaN  10.250000
50%    3.100000  3.0  5.50000  NaN  11.500000
75%    4.050000  3.0  6.25000  NaN  12.750000
max    5.000000  3.0  7.00000  NaN  14.000000

### Unique values, value counts, and membership

In [319]:
s7 = pd.Series(list('gtcgtcaaactttcga')) #serie secuencial adn
s7

0     g
1     t
2     c
3     g
4     t
5     c
6     a
7     a
8     a
9     c
10    t
11    t
12    t
13    c
14    g
15    a
dtype: object

In [320]:
s7.unique()

array(['g', 't', 'c', 'a'], dtype=object)

In [321]:
s7.value_counts()

t    5
a    4
c    4
g    3
dtype: int64

In [322]:
puric_bases=['a', 'g']

s7.isin(puric_bases)

0      True
1     False
2     False
3      True
4     False
5     False
6      True
7      True
8      True
9     False
10    False
11    False
12    False
13    False
14     True
15     True
dtype: bool

In [323]:
s7[s7.isin(puric_bases)]

0     g
3     g
6     a
7     a
8     a
14    g
15    a
dtype: object

## Handling missing data

In [324]:
string_data = pd.Series(['Ma', 'Lu', 'Ca', 'Va', np.nan])
string_data

0     Ma
1     Lu
2     Ca
3     Va
4    NaN
dtype: object

In [ ]:
# no se puede hacer np.nan == np.nan

In [325]:
string_data[~string_data.isnull()]

0    Ma
1    Lu
2    Ca
3    Va
dtype: object

In [328]:
string_data[string_data.isnull()]

4    NaN
dtype: object

### Filtering out missing data

In [329]:
string_data[string_data.notnull()]

0    Ma
1    Lu
2    Ca
3    Va
dtype: object

In [330]:
df5 = pd.DataFrame([[1,2,3], 
                    [np.nan, 8, 7], 
                    [4, np.nan, 90], 
                    [67,42,53]], 
                   columns=list('abc'))
df5

      a     b   c
0   1.0   2.0   3
1   NaN   8.0   7
2   4.0   NaN  90
3  67.0  42.0  53

In [ ]:
# df5 = pd.DataFrame([[1,2,3], [np.nan, 8, 7], [4, np.nan,90], [67,42,53]], columns=list('abc'))

In [331]:
df5[df5['a'].notnull()] #me quita row  correspondiente nan en columna a

      a     b   c
0   1.0   2.0   3
2   4.0   NaN  90
3  67.0  42.0  53

In [332]:
df5.notnull()

       a      b     c
0   True   True  True
1  False   True  True
2   True  False  True
3   True   True  True

In [334]:
df5.isnull().sum()

a    1
b    1
c    0
dtype: int64

In [335]:
df5.isnull().count()

a    4
b    4
c    4
dtype: int64

any() and all() are functions of boolean Series. They reduce the Series to a single boolean value by applying repeatedly the operators "or" and "and", respectively.

In [336]:
df5.notnull().any() # esto como lo que vimos en python de and, or..booleanos. any es almenos

a    True
b    True
c    True
dtype: bool

In [337]:
df5.notnull().all() # solo una columna que lo cumpla

a    False
b    False
c     True
dtype: bool

In [338]:
df5.isnull().any

<bound method DataFrame.any of        a      b      c
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False  False>

In [340]:
df5

      a     b   c
0   1.0   2.0   3
1   NaN   8.0   7
2   4.0   NaN  90
3  67.0  42.0  53

In [339]:
df5.dropna() # me quitas las fila que tiene nan. y ojo que no mofifica df5

      a     b   c
0   1.0   2.0   3
3  67.0  42.0  53

In [341]:
df5.dropna(axis=1) # columnas

    c
0   3
1   7
2  90
3  53

In [344]:
array = np.random.randn(8,3) * 20 + 100

df6 = pd.DataFrame(array, columns=list('xyz'), index=list('abcdefgh'))
df6.iloc[2:5, 1] = np.nan
df6.iloc[1:3, 2] = np.nan
df6

            x           y           z
a  109.848914  111.559246   89.180294
b  113.328214  133.674236         NaN
c   55.596624         NaN         NaN
d   89.201305         NaN  104.816128
e  110.874547         NaN  115.543214
f  133.030008   56.029182  116.315358
g   69.540685   86.259912  111.466917
h  125.989663   94.306677  105.792862

The thresh argument specifies the minimum number of non-null values required to keep a column (or row, with axis=1)

In [345]:
df5.dropna(thresh=2) # para poner un umbral de tolerancia, tambien sobre eje 1

      a     b   c
0   1.0   2.0   3
1   NaN   8.0   7
2   4.0   NaN  90
3  67.0  42.0  53

In [348]:
df6.dropna(thresh=2)

            x           y           z
a  109.848914  111.559246   89.180294
b  113.328214  133.674236         NaN
d   89.201305         NaN  104.816128
e  110.874547         NaN  115.543214
f  133.030008   56.029182  116.315358
g   69.540685   86.259912  111.466917
h  125.989663   94.306677  105.792862

In [346]:
df6.dropna(thresh=2, axis=1)

            x           y           z
a  109.848914  111.559246   89.180294
b  113.328214  133.674236         NaN
c   55.596624         NaN         NaN
d   89.201305         NaN  104.816128
e  110.874547         NaN  115.543214
f  133.030008   56.029182  116.315358
g   69.540685   86.259912  111.466917
h  125.989663   94.306677  105.792862

In [347]:
df6.dropna(thresh=6, axis=1)

            x           z
a  109.848914   89.180294
b  113.328214         NaN
c   55.596624         NaN
d   89.201305  104.816128
e  110.874547  115.543214
f  133.030008  116.315358
g   69.540685  111.466917
h  125.989663  105.792862

### Filling in missing data

In [350]:
df5

      a     b   c
0   1.0   2.0   3
1   NaN   8.0   7
2   4.0   NaN  90
3  67.0  42.0  53

In [349]:
df5.fillna(0)

      a     b   c
0   1.0   2.0   3
1   0.0   8.0   7
2   4.0   0.0  90
3  67.0  42.0  53

In [352]:
df5.fillna({
    'a':0,
    'b':10,
    'c':20
    

})

      a     b   c
0   1.0   2.0   3
1   0.0   8.0   7
2   4.0  10.0  90
3  67.0  42.0  53

In [353]:
df5

      a     b   c
0   1.0   2.0   3
1   NaN   8.0   7
2   4.0   NaN  90
3  67.0  42.0  53

In [354]:
df5.fillna(method='ffill') # rellenado hacia alante

      a     b   c
0   1.0   2.0   3
1   1.0   8.0   7
2   4.0   8.0  90
3  67.0  42.0  53

In [355]:
df5.fillna(df5.median())  # rellenarlo con la mediana los nan

      a     b   c
0   1.0   2.0   3
1   4.0   8.0   7
2   4.0   8.0  90
3  67.0  42.0  53

In [356]:
df5.median()

a     4.0
b     8.0
c    30.0
dtype: float64

# Loading and saving data

## Loading CSV

Let's load information coming from the [US government bureau of Transportation Statistics](https://www.transtats.bts.gov/Tables.asp?DB_ID=111). For convenience, I've made this table available for you from Drive:

In [ ]:
!wget https://bit.ly/ks-pds-csv2 -O {files_loc}/T100_AIRLINES.csv

{files_loc}/T100_AIRLINES.csv: No such file or directory

Make sure the file is there, and store the path in a Python variable using a Linux shell filter:

In [ ]:
!ls {files_loc}

ls: cannot access '{files_loc}': No such file or directory

In [ ]:
contents = !ls {files_loc}/*csv2*
csv_file = contents[0] #storing the first occurrence of the filter, should be our file

In [ ]:
contents = !ls {files_loc}/T100*

In [ ]:
contents

['/content/gdrive/MyDrive/pdsfyles/T100_AIRLINES.csv']

In [ ]:
!more {contents[0]}

"DEPARTURES_SCHEDULED","DEPARTURES_PERFORMED","PAYLOAD","SEATS","PASSENGERS","FR
EIGHT","MAIL","DISTANCE","RAMP_TO_RAMP","AIR_TIME","UNIQUE_CARRIER","AIRLINE_ID"
,"UNIQUE_CARRIER_NAME","UNIQUE_CARRIER_ENTITY","REGION","CARRIER","CARRIER_NAME"
,"CARRIER_GROUP","CARRIER_GROUP_NEW","ORIGIN_AIRPORT_ID","ORIGIN_AIRPORT_SEQ_ID"
,"ORIGIN_CITY_MARKET_ID","ORIGIN","ORIGIN_CITY_NAME","ORIGIN_COUNTRY","ORIGIN_CO
UNTRY_NAME","ORIGIN_WAC","DEST_AIRPORT_ID","DEST_AIRPORT_SEQ_ID","DEST_CITY_MARK
ET_ID","DEST","DEST_CITY_NAME","DEST_COUNTRY","DEST_COUNTRY_NAME","DEST_WAC","AI
RCRAFT_GROUP","AIRCRAFT_TYPE","AIRCRAFT_CONFIG","YEAR","QUARTER","MONTH","DISTAN
CE_GROUP","CLASS",
0.00,1.00,26543.00,76.00,76.00,0.00,0.00,3160.00,0.00,0.00,"02Q",21040,"Titan Ai
rways","71004","I","02Q","Titan Airways",0,0,15174,1517403,32946,"TER","Lajes, P
ortugal","PT","Portugal",469,13204,1320402,31454,"MCO","Orlando, FL","US","Unite
d States",33,6,"622",1,2020,1,1,7,"L",
0.00,1.00,26543.00,76.00,0.00,0.00,0.00,4360.00,0.00,0.00,"02Q",21040,"Titan Air
ways","71004","I","02Q","Titan Airways",0,0,13204,1320402,31454,"MCO","Orlando,
FL","US","United States",33,15018,1501806,30730,"STN","London, United Kingdom","
GB","United Kingdom",493,6,"622",1,2020,1,1,9,"L",
0.00,1.00,7198.00,16.00,2.00,0.00,0.00,3925.00,0.00,0.00,"0BQ",21186,"DCA","7103
3","I","0BQ","DCA",0,0,15022,1502203,35022,"STR","Stuttgart, Germany","DE","Germ
any",429,15167,1516702,35167,"TEB","Teterboro, NJ","US","United States",21,6,"66
7",1,2020,1,1,8,"L",
0.00,1.00,7198.00,16.00,2.00,0.00,0.00,3925.00,0.00,0.00,"0BQ",21186,"DCA","7103
3","I","0BQ","DCA",0,0,15167,1516702,35167,"TEB","Teterboro, NJ","US","United St

In [ ]:
trafficDf = pd.read_csv(contents[0])

In [ ]:
trafficDf.head()

   DEPARTURES_SCHEDULED  DEPARTURES_PERFORMED  ...  CLASS  Unnamed: 43
0                   0.0                   1.0  ...      L          NaN
1                   0.0                   1.0  ...      L          NaN
2                   0.0                   1.0  ...      L          NaN
3                   0.0                   1.0  ...      L          NaN
4                   0.0                   1.0  ...      L          NaN

[5 rows x 44 columns]

In [ ]:
len(trafficDf)

31482

## Saving to Excel

Let's save the first 1000 rows of the dataframe in an Excel file:

In [ ]:
trafficDf.head(1000).to_excel(os.path.join(files_loc, 'excel_output.xls'))

Again, check that the file got generated. If you've got Office, you can test this is indeed a proper excel file:

In [ ]:
!ls {files_loc}

df2.pkl  example.db  excel_output.xls  s3.pkl  T100_AIRLINES.csv

## Saving to CSV

Now, let's truncate our existing dataframe and save the first 10 rows into another CSV:

In [ ]:
trafficDf.head(10).to_csv()

In [ ]:
trafficDf.head(1000).to_csv(os.path.join(files_loc, "out.csv"))

In [ ]:
!ls {files_loc}/*.csv

/content/gdrive/MyDrive/pdsfyles/T100_AIRLINES.csv

In [ ]:
#trafficDf.head(100).to_excel(os.path.join(files_loc, 'excel_output.xls'))

## To Sql Database

Saving to a database with Pandas is trivial as well. For testing purposes, we'll be using a file-based sqlite3 database that we're creating from code:

In [ ]:
import sqlite3
conn = sqlite3.connect(os.path.join(files_loc, 'example.db'))

In [ ]:
trafficDf.to_sql('traffic', conn, if_exists = 'replace')

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [ ]:
!ls -al {files_loc}/example.db

-rw------- 1 root root 7315456 Dec 30 19:32 /content/gdrive/MyDrive/pdsfyles/example.db

In [ ]:
!ls -al {files_loc}

total 17164
-rw------- 1 root root    1291 Dec 30 18:22 df2.pkl
-rw------- 1 root root 7315456 Dec 30 19:32 example.db
-rw------- 1 root root  480256 Dec 30 19:29 excel_output.xls
-rw------- 1 root root     678 Dec 30 17:46 s3.pkl
-rw------- 1 root root 9777233 Dec 30 19:20 T100_AIRLINES.csv

## To dictionary and to json

See documentation of [pandas.DataFrame.to_dict](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_dict.html) to understand different options for converting DataFrames to dictionaries:

In [ ]:
trafficDf.head(2).to_dict(orient='records') #pasar a diccionario

[{'AIRCRAFT_CONFIG': 1,
  'AIRCRAFT_GROUP': 6,
  'AIRCRAFT_TYPE': 622,
  'AIRLINE_ID': 21040.0,
  'AIR_TIME': 0.0,
  'CARRIER': '02Q',
  'CARRIER_GROUP': 0,
  'CARRIER_GROUP_NEW': 0.0,
  'CARRIER_NAME': 'Titan Airways',
  'CLASS': 'L',
  'DEPARTURES_PERFORMED': 1.0,
  'DEPARTURES_SCHEDULED': 0.0,
  'DEST': 'MCO',
  'DEST_AIRPORT_ID': 13204,
  'DEST_AIRPORT_SEQ_ID': 1320402,
  'DEST_CITY_MARKET_ID': 31454,
  'DEST_CITY_NAME': 'Orlando, FL',
  'DEST_COUNTRY': 'US',
  'DEST_COUNTRY_NAME': 'United States',
  'DEST_WAC': 33,
  'DISTANCE': 3160.0,
  'DISTANCE_GROUP': 7,
  'FREIGHT': 0.0,
  'MAIL': 0.0,
  'MONTH': 1,
  'ORIGIN': 'TER',
  'ORIGIN_AIRPORT_ID': 15174,
  'ORIGIN_AIRPORT_SEQ_ID': 1517403,
  'ORIGIN_CITY_MARKET_ID': 32946,
  'ORIGIN_CITY_NAME': 'Lajes, Portugal',
  'ORIGIN_COUNTRY': 'PT',
  'ORIGIN_COUNTRY_NAME': 'Portugal',
  'ORIGIN_WAC': 469,
  'PASSENGERS': 76.0,
  'PAYLOAD': 26543.0,
  'QUARTER': 1,
  'RAMP_TO_RAMP': 0.0,
  'REGION': 'I',
  'SEATS': 76.0,
  'UNIQUE_CARRIER': '02Q',
  'UNIQUE_CARRIER_ENTITY': '71004',
  'UNIQUE_CARRIER_NAME': 'Titan Airways',
  'Unnamed: 43': nan,
  'YEAR': 2020},
 {'AIRCRAFT_CONFIG': 1,
  'AIRCRAFT_GROUP': 6,
  'AIRCRAFT_TYPE': 622,
  'AIRLINE_ID': 21040.0,
  'AIR_TIME': 0.0,
  'CARRIER': '02Q',
  'CARRIER_GROUP': 0,
  'CARRIER_GROUP_NEW': 0.0,
  'CARRIER_NAME': 'Titan Airways',
  'CLASS': 'L',
  'DEPARTURES_PERFORMED': 1.0,
  'DEPARTURES_SCHEDULED': 0.0,
  'DEST': 'STN',
  'DEST_AIRPORT_ID': 15018,
  'DEST_AIRPORT_SEQ_ID': 1501806,
  'DEST_CITY_MARKET_ID': 30730,
  'DEST_CITY_NAME': 'London, United Kingdom',
  'DEST_COUNTRY': 'GB',
  'DEST_COUNTRY_NAME': 'United Kingdom',
  'DEST_WAC': 493,
  'DISTANCE': 4360.0,
  'DISTANCE_GROUP': 9,
  'FREIGHT': 0.0,
  'MAIL': 0.0,
  'MONTH': 1,
  'ORIGIN': 'MCO',
  'ORIGIN_AIRPORT_ID': 13204,
  'ORIGIN_AIRPORT_SEQ_ID': 1320402,
  'ORIGIN_CITY_MARKET_ID': 31454,
  'ORIGIN_CITY_NAME': 'Orlando, FL',
  'ORIGIN_COUNTRY': 'US',
  'ORIGIN_COUNTRY_NAME': 'United States',
  'ORIGIN_WAC': 33,
  'PASSENGERS': 0.0,
  'PAYLOAD': 26543.0,
  'QUARTER': 1,
  'RAMP_TO_RAMP': 0.0,
  'REGION': 'I',
  'SEATS': 76.0,
  'UNIQUE_CARRIER': '02Q',
  'UNIQUE_CARRIER_ENTITY': '71004',
  'UNIQUE_CARRIER_NAME': 'Titan Airways',
  'Unnamed: 43': nan,
  'YEAR': 2020}]

Converting to JSON is quite similar:

In [ ]:
trafficDf.head(2).to_json(orient='records') #pasar a json deseralizando??

'[{"DEPARTURES_SCHEDULED":0.0,"DEPARTURES_PERFORMED":1.0,"PAYLOAD":26543.0,"SEATS":76.0,"PASSENGERS":76.0,"FREIGHT":0.0,"MAIL":0.0,"DISTANCE":3160.0,"RAMP_TO_RAMP":0.0,"AIR_TIME":0.0,"UNIQUE_CARRIER":"02Q","AIRLINE_ID":21040.0,"UNIQUE_CARRIER_NAME":"Titan Airways","UNIQUE_CARRIER_ENTITY":"71004","REGION":"I","CARRIER":"02Q","CARRIER_NAME":"Titan Airways","CARRIER_GROUP":0,"CARRIER_GROUP_NEW":0.0,"ORIGIN_AIRPORT_ID":15174,"ORIGIN_AIRPORT_SEQ_ID":1517403,"ORIGIN_CITY_MARKET_ID":32946,"ORIGIN":"TER","ORIGIN_CITY_NAME":"Lajes, Portugal","ORIGIN_COUNTRY":"PT","ORIGIN_COUNTRY_NAME":"Portugal","ORIGIN_WAC":469,"DEST_AIRPORT_ID":13204,"DEST_AIRPORT_SEQ_ID":1320402,"DEST_CITY_MARKET_ID":31454,"DEST":"MCO","DEST_CITY_NAME":"Orlando, FL","DEST_COUNTRY":"US","DEST_COUNTRY_NAME":"United States","DEST_WAC":33,"AIRCRAFT_GROUP":6,"AIRCRAFT_TYPE":622,"AIRCRAFT_CONFIG":1,"YEAR":2020,"QUARTER":1,"MONTH":1,"DISTANCE_GROUP":7,"CLASS":"L","Unnamed: 43":null},{"DEPARTURES_SCHEDULED":0.0,"DEPARTURES_PERFORMED":1.0,"PAYLOAD":26543.0,"SEATS":76.0,"PASSENGERS":0.0,"FREIGHT":0.0,"MAIL":0.0,"DISTANCE":4360.0,"RAMP_TO_RAMP":0.0,"AIR_TIME":0.0,"UNIQUE_CARRIER":"02Q","AIRLINE_ID":21040.0,"UNIQUE_CARRIER_NAME":"Titan Airways","UNIQUE_CARRIER_ENTITY":"71004","REGION":"I","CARRIER":"02Q","CARRIER_NAME":"Titan Airways","CARRIER_GROUP":0,"CARRIER_GROUP_NEW":0.0,"ORIGIN_AIRPORT_ID":13204,"ORIGIN_AIRPORT_SEQ_ID":1320402,"ORIGIN_CITY_MARKET_ID":31454,"ORIGIN":"MCO","ORIGIN_CITY_NAME":"Orlando, FL","ORIGIN_COUNTRY":"US","ORIGIN_COUNTRY_NAME":"United States","ORIGIN_WAC":33,"DEST_AIRPORT_ID":15018,"DEST_AIRPORT_SEQ_ID":1501806,"DEST_CITY_MARKET_ID":30730,"DEST":"STN","DEST_CITY_NAME":"London, United Kingdom","DEST_COUNTRY":"GB","DEST_COUNTRY_NAME":"United Kingdom","DEST_WAC":493,"AIRCRAFT_GROUP":6,"AIRCRAFT_TYPE":622,"AIRCRAFT_CONFIG":1,"YEAR":2020,"QUARTER":1,"MONTH":1,"DISTANCE_GROUP":9,"CLASS":"L","Unnamed: 43":null}]'

## Reading Excel

To practice reading from Excel, let's load what we saved previously:

In [ ]:
#df2 = pd.read_excel(os.path.join(files_loc, "excel_output.xls")) #aparce column excell se puede quitar con filtro, mirar cuaderno profe
#df2.head()

In [ ]:
df2 = pd.read_excel(os.path.join(files_loc, "excel_output.xls"))

In [ ]:
df2.head()

   Unnamed: 0  DEPARTURES_SCHEDULED  ...  CLASS  Unnamed: 43
0           0                     0  ...      L          NaN
1           1                     0  ...      L          NaN
2           2                     0  ...      L          NaN
3           3                     0  ...      L          NaN
4           4                     0  ...      L          NaN

[5 rows x 45 columns]

If you explore the columns in the database above, you'll realize we brought back some unexpected visitors (columns named "Unnamed", in this case mostly from the own row system in Excel). If you do not want them (for example, to preserve the original dataframe structure that we saved above), you can apply a filter like the following:

In [ ]:
df2 = df2.loc[:, ~df2.columns.str.contains('^Unnamed')]
df2.head()

   DEPARTURES_SCHEDULED  DEPARTURES_PERFORMED  ...  DISTANCE_GROUP  CLASS
0                     0                     1  ...               7      L
1                     0                     1  ...               9      L
2                     0                     1  ...               8      L
3                     0                     1  ...               8      L
4                     0                     1  ...               8      L

[5 rows x 43 columns]

But we could avoid cleaning up unnamed columns by loading the Excel the right way:

In [ ]:
df2 = pd.read_excel(os.path.join(files_loc, "excel_output.xls"), index_col=0)
df2.head()

   DEPARTURES_SCHEDULED  DEPARTURES_PERFORMED  ...  CLASS  Unnamed: 43
0                     0                     1  ...      L          NaN
1                     0                     1  ...      L          NaN
2                     0                     1  ...      L          NaN
3                     0                     1  ...      L          NaN
4                     0                     1  ...      L          NaN

[5 rows x 44 columns]

## Reading mysql database

Finally, let's read from the SQL database we created before:

In [ ]:
df3 = pd.read_sql_query("SELECT * from traffic", conn)

In [ ]:
df3.head()

# Additional References

[Python for Data Analysis](http://shop.oreilly.com/product/0636920023784.do)

[What is SciPy?](https://www.scipy.org/)

[How can SciPy be fast if it is written in an interpreted language like Python?](https://www.scipy.org/scipylib/faq.html#how-can-scipy-be-fast-if-it-is-written-in-an-interpreted-language-like-python)

[What is the difference between NumPy and SciPy?](https://www.scipy.org/scipylib/faq.html#what-is-the-difference-between-numpy-and-scipy)

[Linear Algebra for AI](https://github.com/fastai/fastai/blob/master/tutorials/linalg_pytorch.ipynb)